TMM_src/Documents/ПроведениеАнкетированияОпросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПроведениеАнкетированияОпросов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПочтовоеОтделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПочтовыеОтделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнёр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнёры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнкетаОпрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АнкетыИОпросы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

TMM_src/Enums/ВидыАнкетаОпрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыАнкетаОпрос</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опрос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

TMM_src/Catalogs/АнкетыИОпросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>АнкетыИОпросы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнёр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнёры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАнкетаОпрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

TMM_src/Documents/ПроведениеАнкетированияОпросов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сотрудник = ПараметрыСеанса.Сотрудник;
	КонецЕсли;
	
	
	ПолучитьДанныеАнкеты(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеАнкеты(ОткрытиеОбъекта = Ложь)
	
	Если НЕ ОткрытиеОбъекта Тогда
		Объект.Вопросы.Очистить();
		Ответы.Очистить();
	Иначе
		Для Каждого Стр Из Объект.Вопросы Цикл
		 	Стр.ТекущийВариантОтвета = Стр.ВариантОтвета;
		КонецЦикла;
	КонецЕсли;
	СписокВыбора =  Элементы.ВопросыВариантОтвета.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.АнкетаОпрос) Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.АнкетаОпрос,"Мероприятие,Партнёр");
	Если Данные.Мероприятие = Перечисления.ВидыАнкетаОпрос.Анкетирование  Тогда
		Элементы.Клиент.Видимость = Истина;		
	Иначе	
		Элементы.Клиент.Видимость = Ложь;
	КонецЕсли; 
	
	Элементы.ВопросыВариантОтвета.ВыбиратьТип=Ложь;
	Элементы.ВопросыВариантОтвета.РежимВыбораИзСписка = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АнкетыИОпросыВопросы.Вопрос КАК Вопрос
	               |ПОМЕСТИТЬ Вопросы
	               |ИЗ
	               |	Справочник.АнкетыИОпросы.Вопросы КАК АнкетыИОпросыВопросы
	               |ГДЕ
	               |	АнкетыИОпросыВопросы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АнкетыИОпросыВопросы.Вопрос
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вопросы.Вопрос КАК Вопрос,
	               |	АнкетыИОпросыВопросы.ВариантОтвета КАК ВариантОтвета
	               |ИЗ
	               |	Вопросы КАК Вопросы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АнкетыИОпросы.Вопросы КАК АнкетыИОпросыВопросы
	               |		ПО Вопросы.Вопрос = АнкетыИОпросыВопросы.Вопрос
	               |ГДЕ
	               |	АнкетыИОпросыВопросы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Вопросы.Вопрос,
	               |	АнкетыИОпросыВопросы.ВариантОтвета
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВариантОтвета)
	               |ПО
	               |	Вопрос";	
	Запрос.УстановитьПараметр("Ссылка", Объект.АнкетаОпрос);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВопрос = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	

	Пока ВыборкаВопрос.Следующий() Цикл
		НоваяСтрока = Ответы.Добавить();
		НоваяСтрока.Вопрос = Строка(ВыборкаВопрос.Вопрос);
		
		Выборка = ВыборкаВопрос.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока.ВариантОтвета.Добавить(Строка(Выборка.ВариантОтвета));
		КонецЦикла;
		  НоваяСтрока.ВариантОтвета.Добавить("Другое");
	  КонецЦикла;
	  
	  Для каждого ВопросОтвет Из Ответы Цикл
		  Если НЕ Объект.Вопросы.НайтиСтроки(Новый Структура("Вопрос", ВопросОтвет.Вопрос)).Количество() Тогда
		  	ОбъектВопросы = Объект.Вопросы.Добавить();	
		  	ОбъектВопросы.Вопрос =   ВопросОтвет.Вопрос;
		КонецЕсли;
	  КонецЦикла;
	  
КонецПроцедуры

&НаКлиенте
Процедура АнкетаОпросПриИзменении(Элемент)
	ПолучитьДанныеАнкеты();
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВариантОтветаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.Вопросы.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЯчейкиЗаполнены", ЭтаФорма, ТекСтрока);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из Ответы Цикл
		
		ДанныеВыбора.Добавить();
		МассивЗначений = СтрокаТЧ.ВариантОтвета.ВыгрузитьЗначения();
		ДанныеВыбора.ЗагрузитьЗначения(МассивЗначений);

	КонецЦикла;
		
	ПоказатьВыборИзСписка(ОписаниеОповещенияОЗакрытии, ДанныеВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкиЗаполнены(ВыбранныйЭлемент, ДопПараметры)  Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		
		ДопПараметры.ТекущийВариантОтвета = ВыбранныйЭлемент.Значение;
		
	КонецЕсли;
					 
КонецПроцедуры

&НаКлиенте
Процедура ВопросыТекущийВариантОтветаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.Вопросы.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	ДанныеВыбора = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из Ответы Цикл
		
		Если СтрокаТч.Вопрос = ТекСтрока.Вопрос Тогда
			
			ДанныеВыбора.Добавить();
			МассивЗначений = СтрокаТЧ.ВариантОтвета.ВыгрузитьЗначения();
			ДанныеВыбора.ЗагрузитьЗначения(МассивЗначений);
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЯчейкиЗаполнены", ЭтаФорма, ТекСтрока);
	ПоказатьВыборИзСписка(ОписаниеОповещенияОЗакрытии, ДанныеВыбора, Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого Стр Из Объект.Вопросы Цикл
		Если НЕ Стр.ВариантОтвета = Стр.ТекущийВариантОтвета Тогда
			 Стр.ВариантОтвета =  Стр.ТекущийВариантОтвета;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПолучитьДанныеАнкеты(Истина);
	
КонецПроцедуры
